mikeysklar/esp-usbip-bridge/sdkconfig.defaults.m5stack-poe-p4
CONFIG_IDF_TARGET="esp32p4"
CONFIG_USBIP_BOARD_M5STACK_POE_P4=y
CONFIG_USBIP_TRANSPORT_ETHERNET=y

# Use UART0 for console; USB Serial/JTAG available as secondary.
CONFIG_ESP_CONSOLE_UART_DEFAULT=y
CONFIG_ESP_CONSOLE_SECONDARY_USB_SERIAL_JTAG=y

# M5Stack Unit PoE-P4 Ethernet RMII defaults (same as P4-Function-EV)
CONFIG_USBIP_ETH_MDC_GPIO=31
CONFIG_USBIP_ETH_MDIO_GPIO=52
CONFIG_USBIP_ETH_PHY_ADDR=1
CONFIG_USBIP_ETH_PHY_RST_GPIO=51
